namespace Setting
{
	/// <summary>
	/// <para>設定オブジェクトへの入出力を行う基底クラス。以下の流れで動作することとする。</para>
	/// <para></para>
	/// </summary>
	public abstract class SettingStream
	{
		//--------------------------------------------------------------------------------------------------//
		// method
		//--------------------------------------------------------------------------------------------------//

		public SettingStream() {}

		//--------------------------------------------------------------------------------------------------//
		/// <summary>本オブジェクトで操作する設定オブジェクトを登録する</summary>
		/// <param name="_setting">設定オブジェクト</param>
		public abstract void SetSetting(in Setting _setting);

		//--------------------------------------------------------------------------------------------------//
		/// <summary>登録された設定オブジェクトへ内容を書き込む</summary>
		public abstract void Write();

		//--------------------------------------------------------------------------------------------------//
		/// <summary>設定オブジェクトを登録し、内容を書き込む</summary>
		/// <param name="_setting">設定オブジェクト</param>
		public abstract void Write(in Setting _setting);

		//--------------------------------------------------------------------------------------------------//
		/// <summary>登録された設定オブジェクトから内容を読み出す</summary>
		public abstract void Read();

		//--------------------------------------------------------------------------------------------------//
		/// <summary>設定オブジェクトを登録し、内容を読み出す</summary>
		/// <param name="_setting">設定オブジェクト</param>
		public abstract void Read(in Setting _setting);

		//--------------------------------------------------------------------------------------------------//
		// property
		//--------------------------------------------------------------------------------------------------//
		/// <summary>登録された設定オブジェクト</summary>
		public abstract Setting Setting { get; }

		//--------------------------------------------------------------------------------------------------//
		/// <summary>操作する設定名</summary>
		public abstract string SettingName { get; }

		//--------------------------------------------------------------------------------------------------//
	}
}
